{"Strings":{"Example":"Przykład","General knowledge":"Wiedza ogólna","HotChocolate":"Biblioteka HotChocolate","HotChocolate description":"Biblioteka HotChocolate pozwala na tworzenie GraphQL API w środowisku .NET. GraphQL może być widziany jako alternatywa dla REST, która pozwala użytkownikom API (i wymaga od nich) pytania o zestaw pól przez nich potrzebny, w przeciwieństwie do REST, który zwraca w swojej odpowiedzi wszystkie dostępne pola. Biblioteka ta dobrze współgra ze wstrzykiwaniem zależności i wspiera 3 różne sposoby na definiowanie API: oparte na anotacjach, skupione na kodzie (Code-first) oraz skupione na schemacie (Schema-first).","JavaScript libs":"Biblioteki języka JavaScript","JS functions and arrays":"Funkcje i tablice w języku JavaScript","JS functions and arrays code":"\u0022use strict\u0022;\n\nfunction example()\n{\n    var numbers = [1,5,6,2,3,4,5,3,4,5];\n    console.log(\u0022Liczby: \u0022, numbers);\n    console.log(\u0022Liczby mniejsze od 5: \u0022, numbers.filter(n =\u003E n \u003C 5));\n    console.log(\u0022Do liczb dodano wartość: \u0022, 20);\n    numbers.push(20);\n    numbers.sort();\n    console.log(\u0022Liczby posortowane alfabetycznie w miejscu: \u0022, numbers);\n    numbers.sort((a, b) =\u003E a - b);\n    console.log(\u0022Liczby posortowane numerycznie (rosnąco): \u0022, numbers);\n}\n\nexample();","JS functions and arrays description":"Funkcje w języku JavaScript są definiowane z użyciem słowa kluczowego \u0027function\u0027 po którym następuje nazwa funkcji, nawias otwierający, lista argumentów rozdzielona przecinkami, nawias zamykający i potem ciało funkcji. Ciało funkcji może być zapisane wewnątrz nawiasów klamrowych lub po operatorze \u0027=\u003E\u0027, zakładając, że jest to pojedyncze wyrażenie. Jeżeli operator \u0027=\u003E\u0027 zostanie wykorzystany, to słowo kluczowe \u0027return\u0027 nie musi być użyte aby zwrócić wartość.\nTablice są definiowane wewnątrz nawiasów kwadratowych, i mogą zawierać różne typy przechowane w postaci sekwnecji elementów. Mogą to być liczby, ciągi znaków, obiekty i tablice, które to są indeksowane za pomocą liczb całkowitych, począwszy od 0.","JS objects":"Obiekty w języku JavaScript","JS objects code":"\u0022use strict\u0022;\n\nfunction example()\n{\n    var car = { price: 20000, isNew: false };\n    console.log(\u0022Oryginalny samochód: \u0022, car);\n    car.color = \u0022blue\u0022;\n    console.log(\u0022Pomalowany samochód: \u0022, car);\n    delete car.price;\n    console.log(\u0022Samochód bez ceny: \u0022, car);\n}\n\nexample();","JS objects description":"Obiekty w języku JavaScript są definiowane wewnątrz nawiasów klamrowych. Podczas przypisania obiektu do innej zmiennej, jego zawartość nie jest kopiowana, tylko odwołanie do niego, przez co wskazują na ten sam obiekt, w przeciwieństwie do typów prostych, które przechowują wartości. Właściwości obiektu mogą być dodawane i usuwane dynamicznie.","JS types":"Typy w języku JavaScript","JS types code":"\u0022use strict\u0022;\n\nconsole.log(\u0022true jest typu: \u0022, typeof(true));\nconsole.log(\u00221 jest typu: \u0022, typeof(1));\nconsole.log(\u0027\u0022sentence\u0022 jest typu: \u0027, typeof(\u0022sentence\u0022))\nconsole.log(\u0022[1,2] jest typu: \u0022, typeof([1,2]));\nconsole.log(\u0027{ \u0022data\u0022: 123 } jest typu: \u0027, typeof({ \u0022data\u0022: 123 }));\nconsole.log(\u0022console.log jest typu: \u0022, typeof(console.log));","JS types description":"Typy w języku JavaScript dzielą się na typy proste i typy obiektowe. Wartości typów prostych są niezmienne, a wśród nich: Null, Undefined, Boolean, Number, BigInt, String oraz Symbol. Wartości typów obiektowych są zmienne, a wśród nich typy takie jak funkcje czy tablice. Obiekty składają się z właściwości, które mogą zawierać dane, funkcje albo inne obiekty.","NuGet packages":"Pakiety NuGet","Paged.js description":"Paged.js jest biblioteką open-source, która umożliwia tworzenie porządnie wyglądających dokumentów PDF na podstawie stron HTML wraz z opcjonalnym podglądem na samej witrynie.","Source":"Źródło","System.Text.Json":"Zmiany w przestrzeni nazw System.Text.Json","System.Text.Json description":"Począwszy od platformy .NET 7, kontrakty JSON mogą być dostosowywane na dwa sposoby. Pierwszy z nich polega na utworzeniu nowej instancji typu DefaultJsonTypeInfoResolver i dodaniu akcji do właściwości Modifiers, które to akcje będą wywoływane sekwencyjnie. Drugie podejście wymaga napisanie własnego resolvera implementującego IJsonTypeInfoResolver, gdzie GetTypeInfo powinno zwracać wartość null dla nieobsługiwanych typów. Resolvery mogą być łączone ze sobą, jednakże tylko pierwszy o wartości innej niż null zostanie użyty dla danego typu.","TPH, TPC, TPT":"Podejścia TPH, TPC, TPT - mapowanie hierarchii typów na tabele","TPH, TPC, TPT description":"Biorąc pod uwagę mapowanie hierarchii typów na tabele, istnieją 3 różne podejścia: tabela na hierarchię typów (TPH), tabela na konkretny typ (TPC) oraz tabela na typ (TPT). TPH działa poprzez tworzenie pojedynczej tabeli ze wszystkiml możliwymi właściwościami z hierarchii typów, a sprawuje się najlepiej przy zapytaniach o encje wszystkich typów naraz. TPC tworzy osobną tabelę dla każdego konkretnego typu i  najlepiej działa dla zapytań o liście hierarchii. TPT definiuje osobną tabelę dla każdego typu oraz jest najgorszym z rozwiązań z perspektywy wydajności, pomimo bycia intuicyjnie \u0027najczystszym\u0027 podejściem.","Year2023":"2023"}}