Repository: APB97/apb97.github.io
Catalog: apb97.github.io/ResxResources/Shared/LearningProgress2023.*.resx
Languages: pl_pl

source: Example
pl_pl: Przykład

source: General knowledge
pl_pl: Wiedza ogólna

source: HotChocolate
pl_pl: Biblioteka HotChocolate

source: HotChocolate description
pl_pl: Biblioteka HotChocolate pozwala na tworzenie GraphQL API w środowisku .NET. GraphQL może być widziany jako alternatywa dla REST, która pozwala użytkownikom API (i wymaga od nich) pytania o zestaw pól przez nich potrzebny, w przeciwieństwie do REST, który zwraca w swojej odpowiedzi wszystkie dostępne pola. Biblioteka ta dobrze współgra ze wstrzykiwaniem zależności i wspiera 3 różne sposoby na definiowanie API: oparte na anotacjach, skupione na kodzie (Code-first) oraz skupione na schemacie (Schema-first).

source: JavaScript libs
pl_pl: Biblioteki języka JavaScript

source: JS functions and arrays
pl_pl: Funkcje i tablice w języku JavaScript

source: JS functions and arrays code
pl_pl: "use strict"; function example() { var numbers = [1,5,6,2,3,4,5,3,4,5]; console.log("Liczby: ", numbers); console.log("Liczby mniejsze od 5: ", numbers.filter(n => n < 5)); console.log("Do liczb dodano wartość: ", 20); numbers.push(20); numbers.sort(); console.log("Liczby posortowane alfabetycznie w miejscu: ", numbers); numbers.sort((a, b) => a - b); console.log("Liczby posortowane numerycznie (rosnąco): ", numbers); } example();

source: JS functions and arrays description
pl_pl: Funkcje w języku JavaScript są definiowane z użyciem słowa kluczowego 'function' po którym następuje nazwa funkcji, nawias otwierający, lista argumentów rozdzielona przecinkami, nawias zamykający i potem ciało funkcji. Ciało funkcji może być zapisane wewnątrz nawiasów klamrowych lub po operatorze '=>', zakładając, że jest to pojedyncze wyrażenie. Jeżeli operator '=>' zostanie wykorzystany, to słowo kluczowe 'return' nie musi być użyte, aby zwrócić wartość. Tablice są definiowane wewnątrz nawiasów kwadratowych, i mogą zawierać różne typy przechowane w postaci sekwencji elementów. Mogą to być liczby, ciągi znaków, obiekty i tablice, które to są indeksowane za pomocą liczb całkowitych, począwszy od 0.

source: JS objects
pl_pl: Obiekty w języku JavaScript

source: JS objects code
pl_pl: "use strict"; function example() { var car = { price: 20000, isNew: false }; console.log("Oryginalny samochód: ", car); car.color = "blue"; console.log("Pomalowany samochód: ", car); delete car.price; console.log("Samochód bez ceny: ", car); } example();

source: JS objects description
pl_pl: Obiekty w języku JavaScript są definiowane wewnątrz nawiasów klamrowych. Podczas przypisania obiektu do innej zmiennej, jego zawartość nie jest kopiowana, tylko odwołanie do niego, przez co wskazują na ten sam obiekt, w przeciwieństwie do typów prostych, które przechowują wartości. Właściwości obiektu mogą być dodawane i usuwane dynamicznie.

source: JS types
pl_pl: Typy w języku JavaScript

source: JS types code
pl_pl: "use strict"; console.log("true jest typu: ", typeof(true)); console.log("1 jest typu: ", typeof(1)); console.log('"sentence" jest typu: ', typeof("sentence")) console.log("[1,2] jest typu: ", typeof([1,2])); console.log('{ "data": 123 } jest typu: ', typeof({ "data": 123 })); console.log("console.log jest typu: ", typeof(console.log));

source: JS types description
pl_pl: Typy w języku JavaScript dzielą się na typy proste i typy obiektowe. Wartości typów prostych są niezmienne, a wśród nich: Null, Undefined, Boolean, Number, BigInt, String oraz Symbol. Wartości typów obiektowych są zmienne, a wśród nich typy takie jak funkcje czy tablice. Obiekty składają się z właściwości, które mogą zawierać dane, funkcje albo inne obiekty.

source: NuGet packages
pl_pl: Pakiety NuGet

source: Paged.js description
pl_pl: Paged.js jest biblioteką open-source, która umożliwia tworzenie porządnie wyglądających dokumentów PDF na podstawie stron HTML wraz z opcjonalnym podglądem na samej witrynie.

source: Source
pl_pl: Źródło

source: System.Text.Json
pl_pl: Zmiany w przestrzeni nazw System.Text.Json

source: System.Text.Json description
pl_pl: Począwszy od platformy .NET 7, kontrakty JSON mogą być dostosowywane na dwa sposoby. Pierwszy z nich polega na utworzeniu nowej instancji typu DefaultJsonTypeInfoResolver i dodaniu akcji do właściwości Modifiers, które to akcje będą wywoływane sekwencyjnie. Drugie podejście wymaga napisanie własnego resolvera implementującego IJsonTypeInfoResolver, gdzie GetTypeInfo powinno zwracać wartość null dla nieobsługiwanych typów. Resolvery mogą być łączone ze sobą, jednakże tylko pierwszy o wartości innej niż null zostanie użyty dla danego typu.

source: TPH, TPC, TPT
pl_pl: Podejścia TPH, TPC, TPT - mapowanie hierarchii typów na tabele

source: TPH, TPC, TPT description
pl_pl: Biorąc pod uwagę mapowanie hierarchii typów na tabele, istnieją 3 różne podejścia: tabela na hierarchię typów (TPH), tabela na konkretny typ (TPC) oraz tabela na typ (TPT). TPH działa poprzez tworzenie pojedynczej tabeli ze wszystkiml możliwymi właściwościami z hierarchii typów, a sprawuje się najlepiej przy zapytaniach o encje wszystkich typów naraz. TPC tworzy osobną tabelę dla każdego konkretnego typu i najlepiej działa dla zapytań o liście hierarchii. TPT definiuje osobną tabelę dla każdego typu oraz jest najgorszym z rozwiązań z perspektywy wydajności, pomimo bycia intuicyjnie 'najczystszym' podejściem.
