Repository: APB97/apb97.github.io
Catalog: apb97.github.io/ResxResources/Shared/LearningProgress2025.*.resx
Languages: pl_pl

source: C# 14 Features
pl_pl: Możliwości języka C# 14

source: Example from documentation
pl_pl: Przykład z dokumentacji (po angielsku)

source: General knowledge
pl_pl: Wiedza ogólna

source: NuGet packages
pl_pl: Pakiety NuGet

source: Python Basics
pl_pl: Podstawowy języka Python

source: Python 3
pl_pl: Język Python 3

# Poetry
source: Poetry - package manager for Python
pl_pl: Poetry - menedżer pakietów dla języka Python

source: Using Poetry
pl_pl: Korzystanie z Poetry

source: pyproject.toml for Poetry
pl_pl: Definiowanie pyproject.toml na potrzeby Poetry

# Using Poetry description
source: To add "pytest" dependency from CLI you can use "poetry add pytest" command. To run a script you can use "poetry run python script.py", or "poetry run pytest" for command line tool like "pytest". To install dependencies, use "poetry install", and to update dependencies to newest compatible versions, use"poetry update".
pl_pl: Aby dodać zależność "pytest" z linii komend, można skorzystać z polecenia "poetry add pytest". Aby uruchomić skrypt, można użyć "poetry run python script.py", lub "poetry run pytest" dla narzędzia konsolowego takiego jak "pytest". Aby zainstalować zależności, korzysta się z polecenia "poetry install", a by zaktualizować zależności do najnowszych kompatybilnych wersji, należy użyć polecenia "poetry update".

# pyproject.toml for Poetry description
source: If you want to use Poetry only for dependency management, you can specify "tool.poetry.package-mode=false". When your project uses custom repositories, you can specify them in [tool.poetry.source] section. Sections [tool.poetry.scripts] or [project.scripts] allow to specify tools available to run after installing the package. You can specify dependencies in groups, for instance for "test"group you can list them in: [tool.poetry.group.test.dependencies] section. There is an option to specify optional/extra dependencies in section [project.optional-dependencies].
pl_pl: Jeśli chcesz użyć Poetry tylko do zarządzania zależnościami, możesz dodać wpis "tool.poetry.package-mode=false". Jeżeli twój projekt korzysta z niestandardowych repozytoriów, możesz określić je w sekcji [tool.poetry.source]. Sekcje [tool.poetry.scripts] lub [project.scripts] pozwalają określić narzędzia dostępne do uruchamiania po zainstalowaniu pakietu. Możesz określić zależności w grupach, na przykład dla grupy "test" możesz wylistować je w sekcji: [tool.poetry.group.test.dependencies]. Jest możliwość, aby określać opcjonalne/ekstra zależności w sekcji [project.optional-dependencies].

# Python Basics description
source: Python syntax differs from C-like languages. In Python, scope of code is defined by indentation, "main" is not a special function, instead comparison of __name__ to "__main__" is used to determine if any code needs to run when launching the script. When declaring and assigning variables, there is no keyword like "var", "let", "const", and type of variable can be changed by simple assignment. However, often type hints are used to inform developer and the tooling about accepted or returned types.
pl_pl: Składnia Pythona różni się od języków C-podobnych. W języku Python, zakres kodu jest definiowany za pomocą wcięć, a "main" nie jest specjalną funkcją, natomiast używa się porównania __name__ do "__main__" aby określić, jaki kod ma zostać wykonany podczas uruchamiania skryptu. Gdy deklaruje się zmienne lub przypisuje się im wartości, nie ma słów kluczowych takich jak "var", "let", "const", a typ zmiennej może być zmieniony zwykły przypisaniem. Jednakże, często mechanizm sugerowania typów "type hints" jest używany do informowania dewelopera i narzędzi o przyjmowanych lub zwracanych typach.

source: Python - Advanced topics
pl_pl: Zaawansowane tematy w języku Python

# Python Advanced topics description
source: In Python, there are numerous advanced features. One of them are decorators, which allow to wrap one function call with another, which can be done with funtools.wraps decorator. Other one are context managers, which are quite often used when dealing with resources like files using syntax "with open("t.txt") as f:" which in turn calls functions __enter__ and __exit__ before and after code defined within, respectively.
pl_pl: W języku Python, dostępne jest wiele zaawansowanych możliwości. Jedną z nich są dekoratory, umożliwiające opakowanie jednego wywołania funkcji inną funkcją, co można zrobić za pomocą dekoratora funtools.wraps. Inną są menedżery kontekstu, które są często używane podczas działania z zasobami takimi jak pliki, używając składni "with open("t.txt") as f:" co z kolei wywołuje funkcje __enter__ oraz __exit__, odpowiednio przed i po kodzie zdefiniowanym wewnątrz.

source: nameof support for unbound generic types
pl_pl: W tej wersji języka dodano wsparcie dla niepowiązanych typów generycznych w wyrażeniu nameof. Oznacza to, że aby otrzymać nazwę typu takiego jak List<T>, można użyć "nameof(List<>)" zamiast "nameof(List<string>)", lub dowolnych innych parametrów dla typu generycznego.

source: New extension block for methods and properties
pl_pl: Nowy blok "extension" dla metod i właściwości

# New extension block for methods and properties description
source: Extension methods and even properties can be defined using extension block.
pl_pl: Metody rozszerzeń, i nawet właściwiości rozszerzeń mogą być zdefiniowane w bloku extension.

source: field contextual keyword
pl_pl: kontekstowe słowo kluczowe "field"

# field contextual keyword description
source: This contextual keyword allows to reference compiler-generated backing field in getters or setters of a property. It is one of a breaking changes if you used "field" as a variable/field name.
pl_pl: To kontekstowe słowo kluczowe pozwala na odwołanie się do generowanego przez kompilator pola przechowującego wartość w getterach lub setterach właściwości. Jest to jedna ze zmian, która może wywołać problemy, jeżeli nazwa "field" użyta została jako nazwa zmienne/pola.
