Repository: APB97/apb97.github.io
Catalog: apb97.github.io/ResxResources/Shared/LearningProgress2024.*.resx
Languages: pl_pl

source: Built-in concise syntax for nondesctructive mutation
pl_pl: Wbudowaną zwięzłą składnię na potrzeby niedestrukcyjnej zmiany

source: Built-in formatting
pl_pl: Wbudowane formatowanie na potrzeby wyświetlania

source: Built-in value equality
pl_pl: Wbudowane porównywanie wartości pod kątem równości

source: C# features
pl_pl: Możliwości języka C#

source: Concise syntax for reference types
pl_pl: Wbudowaną zwięzłą składnię na potrzeby deklarowania typów referencyjnych z niemutowalnymi właściwościami

source: Constant interpolated strings
pl_pl: Stałe interpolowane łańcuchy znaków

source: Constant interpolated strings description
pl_pl: Począwszy od C# 10, stałe można zainicjalizować za pomocą interpolacji łańcuchów znaków, o ile wszystkie symbole zastępcze są stałymi łańcuchami. Natomiast symbole zastępcze nie mogą być stałymi numerycznymi, ponieważ są one konwertowane do łańcuchów znaków w trakcie działania aplikacji, gdyż ustawienia regionalne mogą wpływać na ich reprezetancję.

source: Example
pl_pl: Przykład

source: General knowledge
pl_pl: Wiedza ogólna

source: NuGet packages
pl_pl: Pakiety NuGet

source: Records
pl_pl: Rekordy

source: Records description
pl_pl: Zarówno typy referencyjne, jak i typy wartościowe można zadeklarować jako rekordy, a ponadto rekordy typu wartościowego można zadeklarować jako tylko do odczytu. Rekordy mogą być mutowalne, lecz ich zamierzononym zastosowaniem jest wspieranie modeli niemutowalnych. Rekordy oferują następujące możliwości:

source: Source
pl_pl: Źródło

source: StrawberryShake description
pl_pl: Biblioteka StrawberryShake wspomaga tworzenie klientów GraphQL API, na przykład dla aplikacji używających Blazora, pozwalając na wykorzystanie definicji zapytań i mutacji w celu wygenerowania klas i intefejsów klienta, oraz udostępniając zapytania jako komponenty.

source: Basic
pl_pl: Podstawowe

source: Linux basic commands
pl_pl: cd (zmień bieżący katalog), ls (wylistuj pliki w katalogu), pwd (wyświetl ścieżkę bieżącego katalogu roboczego), mkdir (utwórz nowy katalog), rmdir (usuń pusty katalog), rm (usuń plik(i)), touch (aktualizuje daty dostępu i modyfikacji pilku), whoami (odpowiada na pytanie wskazując obecnego użytkownika), cat (wyświetla zawartość pliku), more (wyświetla zawartość plików na ograniczonym wyświetlaczu z nawigacją tylko do przodu), less (wyświetla zawartość pliku na ograniczonym wyświetlaczu z nawigacją w obie strony), ping (pinguje wskazany adres za pomocą protokołu ICMP), apt (konsolowy menedżer pakietów dla Ubuntu i podobnych dystrybucji Linuxa), dnf (konsolowy menedżer pakietów dla dystrybucji Fedora).

source: Linux commands
pl_pl: Komendy linuksowe

source: Advanced
pl_pl: Zaawansowane

source: Linux advanced commands
pl_pl: vim (Vi Improved - konsolowy edytor tekstu), sudo (wykonaj komendy jako użytkownik root albo inny użytkownik), grep (szukaj linii z wyrażeniami w tekście).

source: MSBuild Conditions description
pl_pl: Warunki w MSBuild pozwalają na zaaplikowanie określonych warunków (określenia kiedy dany węzeł ma być użyty), wszędzie, gdzie atrybut "Condition" jest dozwolny.

source: I used MSBuild Conditions to conditionally execute my SimpleResxToJson command-line tool
pl_pl: Użyłem warunków w MSBuild, aby w określonych okolicznościach wywołać moje konsolowe narzędzie "SimpleResxToJson" dla plików resx.

source: MSBuild Conditions
pl_pl: Warunki w MSBuild

source: MSBuild Build Events for C#
pl_pl: Zdarzenia kompilacji w MSBuild dla języka C#

source: MSBuild Build Events for C# description
pl_pl: MSBuild pozwala na wykonywanie dodatkowych akcji podczas procesu kompilacji. Aby wykonać polecenia przed kompilacją, "BeforeTargets" należy ustawić na "PreBuildEvent" i/lub żeby wykonać polecenia po zbudowaniu projektu, "AfterTargets" trzeba ustawić na "PostBuildEvent".

source: I used MSBuild Build Events to perform actions during the build process
pl_pl: Użyłem zdarzeń kompilacji MSBuild aby wykonać polecenia podczas kompilacji mojej aplikacji.
