{"Strings":{"C# 14 Features":"Możliwości języka C# 14","Example from documentation":"Przykład z dokumentacji (po angielsku)","General knowledge":"Wiedza ogólna","NuGet packages":"Pakiety NuGet","Python Basics":"Podstawowy języka Python","Year2025":"2025","Python 3":"Język Python 3","Poetry":"Poetry - menedżer pakietów dla języka Python","Using Poetry":"Korzystanie z Poetry","pyproject.toml for Poetry":"Definiowanie pyproject.toml na potrzeby Poetry","Using Poetry description":"Aby dodać zależność \u0022pytest\u0022 z linii komend, można skorzystać z polecenia \u0022poetry add pytest\u0022. Aby uruchomić skrypt, można użyć \u0022poetry run python script.py\u0022, lub \u0022poetry run pytest\u0022 dla narzędzia konsolowego takiego jak \u0022pytest\u0022. Aby zainstalować zależności, korzysta się z polecenia \u0022poetry install\u0022, a by zaktualizować zależności do najnowszych kompatybilnych wersji, należy użyć polecenia \u0022poetry update\u0022.","pyproject.toml for Poetry description":"Jeśli chcesz użyć Poetry tylko do zarządzania zależnościami, możesz dodać wpis \u0022tool.poetry.package-mode=false\u0022. Jeżeli twój projekt korzysta z niestandardowych repozytoriów, możesz określić je w sekcji [tool.poetry.source]. Sekcje [tool.poetry.scripts] lub [project.scripts] pozwalają określić narzędzia dostępne do uruchamiania po zainstalowaniu pakietu. Możesz określić zależności w grupach, na przykład dla grupy \u0022test\u0022 możesz wylistować je w sekcji: [tool.poetry.group.test.dependencies]. Jest możliwość, aby określać opcjonalne/ekstra zależności w sekcji [project.optional-dependencies].","Python Basics description":"Składnia Pythona różni się od języków C-podobnych. W języku Python, zakres kodu jest definiowany za pomocą wcięć, a \u0022main\u0022 nie jest specjalną funkcją, natomiast używa się porównania __name__ do \u0022__main__\u0022 aby określić, jaki kod ma zostać wykonany podczas uruchamiania skryptu. Gdy deklaruje się zmienne lub przypisuje się im wartości, nie ma słów kluczowych takich jak \u0022var\u0022, \u0022let\u0022, \u0022const\u0022, a typ zmiennej może być zmieniony zwykły przypisaniem. Jednakże, często mechanizm sugerowania typów \u0022type hints\u0022 jest używany do informowania dewelopera i narzędzi o przyjmowanych lub zwracanych typach.","Python Advanced topics":"Zaawansowane tematy w języku Python","Python Advanced topics description":"W języku Python, dostępne jest wiele zaawansowanych możliwości. Jedną z nich są dekoratory, umożliwiające opakowanie jednego wywołania funkcji inną funkcją, co można zrobić za pomocą dekoratora funtools.wraps. Inną są menedżery kontekstu, które są często używane podczas działania z zasobami takimi jak pliki, używając składni \u0022with open(\u0022t.txt\u0022) as f:\u0022 co z kolei wywołuje funkcje __enter__ oraz __exit__, odpowiednio przed i po kodzie zdefiniowanym wewnątrz.","nameof support for unbound generic types":"W tej wersji języka dodano wsparcie dla niepowiązanych typów generycznych w wyrażeniu nameof. Oznacza to, że aby otrzymać nazwę typu takiego jak List\u003CT\u003E, można użyć \u0022nameof(List\u003C\u003E)\u0022 zamiast \u0022nameof(List\u003Cstring\u003E)\u0022, lub dowolnych innych parametrów dla typu generycznego.","New extension block for methods and properties":"Nowy blok \u0022extension\u0022 dla metod i właściwości","New extension block for methods and properties description":"Metody rozszerzeń, i nawet właściwiości rozszerzeń mogą być zdefiniowane w bloku extension.","field contextual keyword":"kontekstowe słowo kluczowe \u0022field\u0022","field contextual keyword description":"To kontekstowe słowo kluczowe pozwala na odwołanie się do generowanego przez kompilator pola przechowującego wartość w getterach lub setterach właściwości. Jest to jedna ze zmian, która może wywołać problemy, jeżeli nazwa \u0022field\u0022 użyta została jako nazwa zmienne/pola.","EF Core Features":"Możliwości biblioteki EF Core","AsSplitQuery vs AsSingleQuery":"AsSplitQuery kontra AsSingleQuery","AsSplitQuery vs AsSingleQuery description":"Pojedyncze zapytania mogą powodować poważne problemy z wydajnością gdy wiele tabel jest łączonych za pomocą operacji JOIN w zapytaniu. Jednym z tych poroblemów jest eksplozja kartezjańska - gdy nawigacje kolekcji są na tym samym poziomie, powoduje to, że baza danych zwraca wiele wierszy dla pojedynczego obiektujako wynik operacji \u0022cross product\u0022. Innym problemem jest duplikacja danych, nawet używając pojedynczej nawigacji - każdy zwrócony wiersz zawiera wszystkie właściwości z obu tabel, jednak może to być poprawione przez zaaplikowanie projekcji by zredukować ilość danych. Używając rozdzielonych zapytań, te problemy mogą być rozwiązane, poprzez wykorzystanie osobnych zapytań dla każdej dołączonej nawigacji."}}