{"Strings":{"C# 14 Features":"C# 14 Features","Example from documentation":"Example from documentation","General knowledge":"General knowledge","NuGet packages":"NuGet packages","Python Basics":"Python Basics","Year2025":"2025","Python 3":"Python 3","Poetry":"Poetry - package manager for Python","Using Poetry":"Using Poetry","pyproject.toml for Poetry":"pyproject.toml for Poetry","Using Poetry description":"To add \u0022pytest\u0022 dependency from CLI you can use \u0022poetry add pytest\u0022 command. To run a script you can use \u0022poetry run python script.py\u0022, or \u0022poetry run pytest\u0022 for command line tool like \u0022pytest\u0022. To install dependencies, use \u0022poetry install\u0022, and to update dependencies to newest compatible versions, use\u0022poetry update\u0022.","pyproject.toml for Poetry description":"If you want to use Poetry only for dependency management, you can specify \u0022tool.poetry.package-mode=false\u0022. When your project uses custom repositories, you can specify them in [tool.poetry.source] section. Sections [tool.poetry.scripts] or [project.scripts] allow to specify tools available to run after installing the package. You can specify dependencies in groups, for instance for \u0022test\u0022group you can list them in: [tool.poetry.group.test.dependencies] section. There is an option to specify optional/extra dependencies in section [project.optional-dependencies].","Python Basics description":"Python syntax differs from C-like languages. In Python, scope of code is defined by indentation, \u0022main\u0022 is not a special function, instead comparison of __name__ to \u0022__main__\u0022 is used to determine if any code needs to run when launching the script. When declaring and assigning variables, there is no keyword like \u0022var\u0022, \u0022let\u0022, \u0022const\u0022, and type of variable can be changed by simple assignment. However, often type hints are used to inform developer and the tooling about accepted or returned types.","Python Advanced topics":"Python - Advanced topics","Python Advanced topics description":"In Python, there are numerous advanced features. One of them are decorators, which allow to wrap one function call with another, which can be done with funtools.wraps decorator. Other one are context managers, which are quite often used when dealing with resources like files using syntax \u0022with open(\u0022t.txt\u0022) as f:\u0022 which in turn calls functions __enter__ and __exit__ before and after code defined within, respectively.","nameof support for unbound generic types":"This version added support for unbound generic types in the nameof expression. This means to get name of the type like List\u003CT\u003E, you can use \u0022nameof(List\u003C\u003E)\u0022 instead of \u0022nameof(List\u003Cstring\u003E)\u0022, or any other type parameters for generic type.","New extension block for methods and properties":"New extension block for methods and properties","New extension block for methods and properties description":"Extension methods and even properties can be defined using extension block.","field contextual keyword":"field contextual keyword","field contextual keyword description":"This contextual keyword allows to reference compiler-generated backing field in getters or setters of a property. It is one of a breaking changes if you used \u0022field\u0022 as a variable/field name."}}