{"Strings":{"Built-in concise syntax for nondesctructive mutation":"Wbudowaną zwięzłą składnię na potrzeby niedestrukcyjnej zmiany","Built-in formatting":"Wbudowane formatowanie na potrzeby wyświetlania","Built-in value equality":"Wbudowane porównywanie wartości pod kątem równości","C# features":"Możliwości języka C#","Concise syntax for reference types":"Wbudowaną zwięzłą składnię na potrzeby deklarowania typów referencyjnych z niemutowalnymi właściwościami","Constant interpolated strings":"Stałe interpolowane łańcuchy znaków","Constant interpolated strings description":"Począwszy od C# 10, stałe można zainicjalizować za pomocą interpolacji łańcuchów znaków, o ile wszystkie symbole zastępcze są stałymi łańcuchami. Natomiast symbole zastępcze nie mogą być stałymi numerycznymi, ponieważ są one konwertowane do łańcuchów znaków w trakcie działania aplikacji, gdyż ustawienia regionalne mogą wpływać na ich reprezetancję.","Example":"Przykład","General knowledge":"Wiedza ogólna","NuGet packages":"Pakiety NuGet","Records":"Rekordy","Records description":"Zarówno typy referencyjne, jak i typy wartościowe można zadeklarować jako rekordy, a ponadto rekordy typu wartościowego można zadeklarować jako tylko do odczytu. Rekordy mogą być mutowalne, lecz ich zamierzononym zastosowaniem jest wspieranie modeli niemutowalnych. Rekordy oferują następujące możliwości:","Source":"Źródło","StrawberryShake description":"Biblioteka StrawberryShake wspomaga tworzenie klientów GraphQL API, na przykład dla aplikacji używających Blazora, pozwalając na wykorzystanie definicji zapytań i mutacji w celu wygenerowania klas i intefejsów klienta, oraz udostępniając zapytania jako komponenty.","Year2024":"2024","Basic":"Podstawowe","Linux basic commands":"cd (zmień bieżący katalog), ls (wylistuj pliki w katalogu), pwd (wyświetl ścieżkę bieżącego katalogu roboczego), mkdir (utwórz nowy katalog), rmdir (usuń pusty katalog), rm (usuń plik(i)), touch (aktualizuje daty dostępu i modyfikacji pilku), whoami (odpowiada na pytanie wskazując obecnego użytkownika), cat (wyświetla zawartość pliku), more (wyświetla zawartość plików na ograniczonym wyświetlaczu z nawigacją tylko do przodu), less (wyświetla zawartość pliku na ograniczonym wyświetlaczu z nawigacją w obie strony), ping (pinguje wskazany adres za pomocą protokołu ICMP), apt (konsolowy menedżer pakietów dla Ubuntu i podobnych dystrybucji Linuxa), dnf (konsolowy menedżer pakietów dla dystrybucji Fedora).","Linux commands":"Komendy linuksowe","Advanced":"Zaawansowane","Linux advanced commands":"vim (Vi Improved - konsolowy edytor tekstu), sudo (wykonaj komendy jako użytkownik root albo inny użytkownik), grep (szukaj linii z wyrażeniami w tekście).","MSBuild Conditions description":"Warunki w MSBuild pozwalają na zaaplikowanie określonych warunków (określenia kiedy dany węzeł ma być użyty), wszędzie, gdzie atrybut \u0022Condition\u0022 jest dozwolny.","I used MSBuild Conditions to conditionally execute my SimpleResxToJson command-line tool":"Użyłem warunków w MSBuild, aby w określonych okolicznościach wywołać moje konsolowe narzędzie \u0022SimpleResxToJson\u0022 dla plików resx.","MSBuild Conditions":"Warunki w MSBuild"}}