{"Strings":{"Built-in concise syntax for nondesctructive mutation":"Built-in concise syntax for nondesctructive mutation","Built-in formatting":"Built-in formatting for display purposes","Built-in value equality":"Built-in value equality","C# features":"C# features","Concise syntax for reference types":"Concise syntax for reference types with immutable properties","Constant interpolated strings":"Constant interpolated strings","Constant interpolated strings description":"Starting from C# 10, constants may be initialized using string interpolation, given all placeholders are constant strings. However the placeholder expression can\u0027t be numeric constants because they are converted to strings at runtime, since current culture may affect their representation. ","Example":"Example","General knowledge":"General knowledge","NuGet packages":"NuGet packages","Records":"Records","Records description":"Both value and reference types can be declared as records, and record structs can be declared as readonly. Records can be mutable, however they are intended for supporting immutable models. Records offer the following features:","Source":"Source","StrawberryShake description":"StrawberryShake library aids in creating GraphQL API clients, for example for Blazor applications, allowing usage of query and mutation definitions\u0027 to generate Client classes and interfaces, and exposing queries as components.","Year2024":"2024","Basic":"Basic","Linux basic commands":"cd (change directory), ls (list files in a directory), pwd (print working directory), mkdir (create a directory), rmdir (remove an empty directory), rm (remove file(s)), touch (update accessed and modified dates of a file), whoami (answers the question by indicating current user), cat (display contents of a file), more (display contents of files but in limited size display with forward-only navigation), less (display contents of file in limited display with both forward and backward navigation), ping (pings the destination with ICMP protocol), apt (command-line package manager for Ubuntu and similar distributions of Linux), dnf (command-line package manager for Fedora).","Linux commands":"Linux commands","Advanced":"Advanced","Linux advanced commands":"vim (Vi Improved - command-line text editor), sudo (execute commands as a root or a different user), grep (search for lines with expressions in text)."}}