{"Strings":{"features and rules":"funkcjonalności i zasady","Features":"Funkcjonalności","Print multiple ones":"Drukuj wiele sudoku","or":"lub","To start playing use the navigation menu or press the button below.":"Aby zacząć, skorzystaj z menu nawigacyjnego lub użyj przycisku poniżej.","Saving and loading":"Zapisywanie i odczytywanie","New":"Nowość","Print multiple":"Drukuj wiele","Clear all":"Wyczyść wszystko","Start playing":"Rozpocznij","Separate page which allows preparing mulitple sudoku boards and allows generating adjustable amount of additional sudoku boards at once.":"Osobna strona która pozwala na przygotowanie wielu sudoku do druku i umożliwia wygenerowanie dostosowywalnej ilości dodatkowych sudoku naraz.","Every board can be regenerated or removed.":"Każde sudoku może być wygenerowane ponownie lub usunięte.","Also includes":"Ponadto zawiera przycisk","button for starting from scratch by clearing all boards on the page.":"pozwalający na rozpoczęcie od nowa poprzez wyczyszczenie wszystkich sudoku na stronie.","Sudoku rules":"Reguły sudoku","Sudoku board is divided into 9 squares with 3x3 grid of cells.":"Sudoku jest podzielone na 9 kwadratów z siatką komórek 3 na 3.","Each cell on the board should be filled with digits 1 through 9.":"Każda komórka powinna być uzupełniona cyfrą od 1 do 9.","Inside of each 3x3 square, column and row, any given digit can appear only once.":"Wewnątrz każdego kwadratu 3 na 3, kolumny i wiersza, dowolna cyfra może pojawić się tylko raz.","You start a game with a board where some of the cells have been assigned a digit that cannot be changed.":"Zaczynasz grę z sudoku, którego część komórek ma przydzieloną wartość, której nie można zmienić.","You should fill the board according to the rules.":"Należy uzupełnić sudoku zgodnie z regułami gry.","Sudoku state can be saved and loaded.":"Stan sudoku może być zapisany i wczytany.","Currently saves to and loads from browser\u0027s LocalStorage.":"Obecnie aplikacja zapisuje i wczytuje stan z lokalnej pamięci przeglądarki.","Printing":"Drukowanie","You can print the sudoku board with ability to adjust the following options":"Można wydrukować sudoku z następującymi opcjami","Print filled values":"Drukuj uzupełnione wartości","Print highlighted errors":"Drukuj podświetlone błędy","if checked":"jeśli zaznaczona","this option will include user-filled cell values in the printed version.":"ta opcja dołączy wartości uzupełnione przez użytkownika w wydruku.","This option must be checked for option":"Ta opcja musi być zaznaczona, aby opcja","to be available.":"była dostępna.","Print backgrounds":"Drukuj tła","and given that there is active highlighting of conflicting cell values":"i pod warunkiem, że jest aktywne podświetlenie niezgodnych wartości komórek","this option will include highlighting of errors in the printed version.":"ta opcja dołączy podświetlenie błędów w wydruku","Please note that for this option to take effect, You need to enable option":"Należy zauważyć, że aby ta opcja zadziałała, trzeba włączyć opcję","while preparing printed sudoku.":"podczas przygotowywania sudoku do druku.","Validation":"Walidacja","Any editable cells\u0027 values conflicting with sudoku rules are highlighted automatically after changing cell\u0027s value.":"Wartości każdej edytowalnej komórki, które są niezgodne z zasadami sudoku są automatycznie podświetlane po zmianie wartości komórki.","Navigation":"Nawigacja","You can navigate cells within the sudoku board using arrow keys.":"Można nawigować między komórkami wewnątrz sudoku za pomocą strzałek.","Supports moving between the first and the last cell in a row or column.":"Wspiera przemieszczanie pomiędzy pierwszą i ostatnią komórką w wierszu lub kolumnie.","Pressing \u0027Enter\u0027 allows to navigate to the next cell, or to the top-left one if pressed in the bottom-right cell.":"Wciskając \u0027Enter\u0027 można nawigować do następnej komórki, lub do komórki w lewym górnym rogu, jeżeli wciśnięty został w komórce w prawym dolnym rogu.","Target cell will have its value selected.":"Wartość docelowej komórki zostanie zaznaczona.","Manage settings":"Zarządzaj ustawieniami","Adjustable settings":"Dostosowywalne ustawienia","Desired blank cells":"Docelowa liczba pustych komórek","Cell blanking attempts":"Ilość prób wyczyszczenia komórki","Maximum amount of cells that can be blank":"Maksymalna liczba komórek które mogą być puste. Zwiększenie tego parametru wydłuża czas generowania sudoku.","Maximum attempts to blank next cell":"Maksymalna liczba prób wyczyszczenia następnej komórki. Zwiększenie tego parametru nieznacznie wydłuża czas generowania sudoku i zwiększa częstotliwość generowania sudoku z oczekiwaną liczbą pustych komórek.","The following sudoku generation settings can be adjusted":"Poniższe ustawienia generowania sudoku mogą być dostosowane","When saving or loading a small popup message appears":"Podczas zapisywania lub ładowania na krótki moment pojawia się niewielki popup z odpowiednią informacją."}}