Repository: APB97/apb97.github.io
Catalog: apb97.github.io/ResxResources/Pages/CountAndSay.*.resx
Languages: pl_pl

source: and
pl_pl: oraz

source: Challenge description
pl_pl: Opis wyzwania

source: Convert
pl_pl: Konwertuj

source: Count and say
pl_pl: Policz i wymów

source: Explanation
pl_pl: Objaśnienie

source: for any number between
pl_pl: dla dowolnej liczby między

source: For example,
pl_pl: Na przykład,

source: functionName
pl_pl: PoliczIWymow

source: Input
pl_pl: Wejście

source: is not
pl_pl: to nie jest

source: is the way you would 'say' the digit string from
pl_pl: jest sposobem, jakim "wymówiłbyś" ciąg znaków z

source: is written as
pl_pl: zapisuje się jako

source: Note
pl_pl: Informacja

source: Number
pl_pl: Liczba:

source: NumberOfSayings
pl_pl: Ilość wymówień

source: Out of range
pl_pl: Wprowadzona wartość była z poza zakresu dozwolonych wartości

source: Output
pl_pl: Wyjście

source: Result
pl_pl: Rezultat

source: The count-and-say sequence is a sequence
pl_pl: Ciąg policz-i-wymów jest ciągiem łańcuchów znaków zawierających cyfry, a zdefiniowany jest przez rekursywny wzór

source: Then for each group, say
pl_pl: Potem dla każdej z grup wymów liczbę znaków, a następnie znak.

source: To convert the saying
pl_pl: Aby przekonwertować zdanie na ciąg cyfr, należy zastąpić ilości liczbą i połączyć w całość.

source: To determine how you
pl_pl: Aby określić jak "wymawiać" ciąg znaków złożony z cyfr, podziel go na minimalną liczbę grup takich, że każda jest ciągłą sekcją tych samych znaków.

source: which is then converted into a different digit string
pl_pl: który jest potem konwertowany na kolejny ciąg znaków złożony z cyfr

source: You can use the url
pl_pl: Możesz użyć adresu URL z paska adresu aby odwiedzić stronę i jednocześnie przewinąć do sekcji "Wyjście"
